fpvFoam/constant/tableProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      tableProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mixtureFractionDefinition "readFromTable";

interpolationType       linearInterpolation;

operatingPressure       1e5;

canteraFileName         "tables/Table";

C_param
          60
(
   0.00000000    
   4.91557969E-03
   9.83115938E-03
   1.47467395E-02
   1.96623188E-02
   2.45779008E-02
   2.94934791E-02
   3.44090573E-02
   3.93246375E-02
   4.42402214E-02
   4.91558015E-02
   5.40713780E-02
   5.89869581E-02
   6.39025420E-02
   6.88181147E-02
   7.37337023E-02
   7.86492750E-02
   8.35648552E-02
   8.84804428E-02
   9.33960155E-02
   9.83116031E-02
  0.103227176    
  0.108142756    
  0.113058344    
  0.117973916    
  0.122889496    
  0.127805084    
  0.132720649    
  0.137636229    
  0.142551810    
  0.147467405    
  0.152382985    
  0.157298550    
  0.162214130    
  0.167129710    
  0.172045305    
  0.176960886    
  0.181876451    
  0.186792031    
  0.191707611    
  0.196623206    
  0.201538786    
  0.206454352    
  0.211369932    
  0.216285512    
  0.221201092    
  0.226116687    
  0.231032252    
  0.235947832    
  0.240863413    
  0.245778993    
  0.250694573    
  0.255610168    
  0.260525733    
  0.265441298    
  0.270356894    
  0.275272459    
  0.280188054    
  0.285103619    
  0.290019214    
);

Zeta_param
          80
(
   0.00000000    
   4.00576864E-05
   1.60230746E-04
   3.60519101E-04
   6.40922983E-04
   1.00144208E-03
   1.44207641E-03
   1.96282635E-03
   2.56369193E-03
   3.24467220E-03
   4.00576834E-03
   4.84697940E-03
   5.76830562E-03
   6.76974887E-03
   7.85130542E-03
   9.01297852E-03
   1.02547677E-02
   1.15766702E-02
   1.29786888E-02
   1.44608244E-02
   1.60230733E-02
   1.76654402E-02
   1.93879176E-02
   2.11905148E-02
   2.30732225E-02
   2.50360519E-02
   2.70789955E-02
   2.92020496E-02
   3.14052217E-02
   3.36885117E-02
   3.60519141E-02
   3.84954326E-02
   4.10190709E-02
   4.36228141E-02
   4.63066809E-02
   4.90706638E-02
   5.19147553E-02
   5.48389703E-02
   5.78432977E-02
   6.09277338E-02
   6.40922934E-02
   6.73369691E-02
   7.06617609E-02
   7.40666464E-02
   7.75516704E-02
   8.11168104E-02
   8.47620592E-02
   8.84874314E-02
   9.22928900E-02
   9.61784944E-02
  0.100144207    
  0.104190037    
  0.108315982    
  0.112522043    
  0.116808198    
  0.121174484    
  0.125620887    
  0.130147412    
  0.134754047    
  0.139440805    
  0.144207656    
  0.149054632    
  0.153981730    
  0.158988953    
  0.164076284    
  0.169243693    
  0.174491256    
  0.179818943    
  0.185226724    
  0.190714642    
  0.196282655    
  0.201930776    
  0.207659021    
  0.213467389    
  0.219355881    
  0.225324482    
  0.231373191    
  0.237501994    
  0.243710935    
  0.250000000    
);

Z_param
          60
(
   0.00000000    
   1.35932993E-02
   2.71865986E-02
   4.07798961E-02
   5.43731973E-02
   6.79664984E-02
   8.15597922E-02
   9.51530933E-02
  0.108746395    
  0.122339696    
  0.135932997    
  0.149526298    
  0.163119584    
  0.176712885    
  0.190306187    
  0.203899488    
  0.217492789    
  0.231086090    
  0.244679391    
  0.258272678    
  0.271865994    
  0.285459280    
  0.299319804    
  0.313447475    
  0.327842414    
  0.342504501    
  0.357433796    
  0.372630298    
  0.388094008    
  0.403824896    
  0.419822991    
  0.436088294    
  0.452620804    
  0.469420493    
  0.486487389    
  0.503821492    
  0.521422803    
  0.539291263    
  0.557426989    
  0.575829923    
  0.594500005    
  0.613437355    
  0.632641792    
  0.652113497    
  0.671852410    
  0.691858530    
  0.712131798    
  0.732672334    
  0.753480017    
  0.774554968    
  0.795897067    
  0.817506373    
  0.839382887    
  0.861526549    
  0.883937478    
  0.906615555    
  0.929560900    
  0.952773392    
  0.976253092    
   1.00000000    
);

// ************************************************************************* //
