fpvFoam/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// ************************************************************************* //

dimensions          [ 1 -1 -2 0 0 0 0 ];

internalField       uniform 1e+05;

boundaryField
{
    AXIS
    {
        type            empty;
    }
    JET
    {
        type            zeroGradient;
    }
    PILOT
    {
        type            zeroGradient;
    }
    COFLOW
    {
        type            zeroGradient;
    }
    WALL
    {
        type            zeroGradient;
    }
    OUTLET
    {
        type            fixedValue;
        value           uniform 1e5;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
