fpvFoam/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// ************************************************************************* //

dimensions          [ 0 0 0 1 0 0 0 ];

internalField       uniform 300;

boundaryField
{    
    AXIS
    {
        type            empty;
    }
    JET
    {
        type            calculated;
        value           uniform 300;
    }
    PILOT
    {
        type            calculated;
        value           uniform 300;
    }
    COFLOW
    {
        type            calculated;
        value           uniform 300;
    }
    WALL
    {
        type            calculated;
        value           uniform 300;
    }
    OUTLET
    {
        type            calculated;
        value           uniform 300;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
