fpvFoam/0/muSgs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      muSgs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    AXIS
    {
        type empty;
    }
    JET
    {
        type            calculated;
        value           uniform 0;
    }
    PILOT
    {
        type            calculated;
        value           uniform 0;
    }
    COFLOW
    {
        type            calculated;
        value           uniform 0;
    }
    WALL
    {
	    //type            mutkWallFunction;
	    //Cmu             0.09;
	    //kappa           0.41;
	    //E               9.8;
	    //value           uniform 0;
	type  zeroGradient;
    }
    OUTLET
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
